from models import db, Team, PlayerSeasonStats  # or other related models
from app import app
team_mapping = {"מ.ס. אשדוד": "מועדון ספורט אשדוד",
                    "בני יהודה ת\"א": "בני יהודה תל אביב",
                    "מכבי הרצליה דיוויד יחזקאל": "מכבי הרצליה",
                    "הפועל כפ\"ס": "הפועל כפר סבא",
                    "מכבי ת\"א": "מכבי תל אביב",
                    "הפועל ת\"א": "הפועל תל אביב",
                    "בית\"ר י-ם": "בית\"ר ירושלים",
                    "מכבי  פ\"ת": "מכבי פתח תקווה",
                    "הכח מכבי עמידר ר\"ג": "הכח עמידר רמת גן",
                    "הפ' פ\"ת נחום סטלמך": "הפועל פתח תקווה ",
                    "הפועל פ\"ת": "הפועל פתח תקווה",
                    "מכבי נתניה שלומי": "מכבי נתניה",
                    "הפ' בני לוד רכבת": "הפועל בני לוד",
                    "הכח מכבי עמידר ר\"ג \"לופא\" קדוש": "הכח עמידר רמת גן",
                    "הפועל ק\"ש": "הפועל קריית שמונה",
                    "הפועל ב\"ש": "הפועל באר שבע",
                    "מכבי פ\"ת עסיסי דוד": "מכבי פתח תקווה",
                    "מכבי ת\"א שחר": "מכבי תל אביב",
                    "מכבי חיפה \"הרדי\"": "מכבי חיפה",
                    "הפועל ניר רמה\"ש": "הפועל ניר רמת השרון",
                    "הפועל ר\"ג": "הפועל רמת גן",
                    "בית\"ר י-ם אורן": "בית\"ר ירושלים",
                    "בני יהודה ת\"א בראל חדריה שמואל": "בני יהודה תל אביב",
                    "הפועל ע. אשקלון / לא פעיל": "הפועל עירוני אשקלון",
                    "הפ' ב\"ש השלושה": "הפועל באר שבע",
                    "הפועל ראשל\"צ": "הפועל ראשון לציון",
                    "הפ' ראשל'צ יהודה": "הפועל ראשון לציון",
                    "הפ' ת\"א ניסנוב": "הפועל תל אביב",
                    "הפ' חדרה ש. שוורץ": "הפועל חדרה",
                    "הפ' נוף הגליל": "הפועל נוף הגליל",
                    "הפועל י-ם": "הפועל ירושלים",
                    "הפועל א.א. פאחם": "הפועל אום אל פחם",
                    "מ.ס. כפר קאסם סוהיב": "מועדון ספורט כפר קאסם",
                    "הפ' חיפה רובי": "הפועל חיפה",
                    "עירוני דורות טבריה": "עירוני טבריה"
} 
    

with app.app_context():
    for dup_name, canonical_name in team_mapping.items():
        print("removing:",dup_name)
        duplicate_team = Team.query.filter_by(team_name=dup_name).first()
        if not duplicate_team:
            continue
        db.session.delete(duplicate_team)
    db.session.commit()
